TOLLcase2D/constant/optProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      optProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

alphasolidini   alphasolidini [1 -3 -1 0 0 0 0] 1e6;
alphasolidmax   alphasolidmax [1 -3 -1 0 0 0 0] 1e6;
alphaMaxdelta   alphaMaxdelta [1 -3 -1 0 0 0 0] 10;
alphaMax        alphaMax      [1 -3 -1 0 0 0 0] 1e9;
alphasolidmin   alphasolidmin [1 -3 -1 0 0 0 0] 0;

asqaini         0.001;
asqa            0.001;
asqadelta       0.001;
asqamax         0.1;

raa0                   1e-5;
mma_init               0.2;
mma_dec                0.7;
mma_inc                1.2;
movlim                 0.5;

V0                     0.6;

D_normalization        6.66804e-07;

J1                     0.05;

// twice the mesh size
Rmesh                  Rmesh [0 1 0 0 0 0 0] 5e-6;
geo_dim                2;

MaxUloop               1000;
MaxUaloop              400;
MaxUcloop              400;

Uresidualset           1e-3;
Ucresidualset          1e-3;
Uaresidualset          1e-3;

// ************************************************************************* //
