TOLLcase2D/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
32000
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    INLET1
    {
        type            fixedValue;
        value           uniform 1;
    }
    INLET2
    {
        type            fixedValue;
        value           uniform 0;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    ALLWALL
    {
        type            zeroGradient;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
