TOLLcase2D/0/pc
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      pc;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    INLET1
    {
        type            zeroGradient;
    }
    INLET2
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            adjointOutletPressurePower;
        value           uniform 0 ;
    }
    ALLWALL
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
