TOLLcase2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
     "(C|Ca)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }
    "(pa|p|pc)"
    {
        solver          GAMG;
        tolerance       1e-9;
        relTol          0.01;
        smoother        GaussSeidel;
    }
    "(paFinal|pcFinal)"
    {
        $p_rgh;
        relTol          0;
    }
    "(U|Ua|Uc)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
        nSweeps         2;
    }
    "(fsensPDE|gsensPDE|dvgPDE)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;

}

relaxationFactors
{
    fields
    {
        "(p|pa|pc)"     0.3;
        dvg             0.1;
    }
    equations
    {
        "(U|Ua|Uc)"     0.7;
    }
}

mixing_index
{
    number_mixing_index_patches      1;
    mixing_index_patches_names       (OUTLET);
}
power_dissipation
{
    number_power_dissipation_Patches     3;
    power_dissipation_patches_names      (INLET1 INLET2 OUTLET);
}
// ************************************************************************* //
