TOLLcase2D/Allrun
decomposePar
nohup mpirun -np 4 TOLL -parallel &
